; domain
(define (domain gripper-strips)
 (:requirements :strips :typing) 
 (:types room object robot gripper)
 (:predicates (at-robby ?r - robot ?x - room)
 	      (at ?o - object ?x - room)
	      (free ?r - robot ?g - gripper)
	      (carry ?r - robot ?o - object ?g - gripper))

   (:action move
       :parameters  (?r - robot ?from ?to - room)
       :precondition (and  (at-robby ?r ?from))
       :effect (and  (at-robby ?r ?to)
		     (not (at-robby ?r ?from))))

   (:action pick
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (at ?obj ?room) (at-robby ?r ?room) (free ?r ?g))
       :effect (and (carry ?r ?obj ?g)
		    (not (at ?obj ?room)) 
		    (not (free ?r ?g))))

   (:action drop
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (carry ?r ?obj ?g) (at-robby ?r ?room))
       :effect (and (at ?obj ?room)
		    (free ?r ?g)
		    (not (carry ?r ?obj ?g)))))

; problem
(define (problem gripper-3-37-35)
(:domain gripper-strips)
(:objects robot1 robot2 robot3 - robot
rgripper1 lgripper1 rgripper2 lgripper2 rgripper3 lgripper3 - gripper
room1 room2 room3 room4 room5 room6 room7 room8 room9 room10 room11 room12 room13 room14 room15 room16 room17 room18 room19 room20 room21 room22 room23 room24 room25 room26 room27 room28 room29 room30 room31 room32 room33 room34 room35 room36 room37 - room
ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 ball32 ball33 ball34 ball35 - object)
(:init
(at-robby robot1 room5)
(free robot1 rgripper1)
(free robot1 lgripper1)
(at-robby robot2 room2)
(free robot2 rgripper2)
(free robot2 lgripper2)
(at-robby robot3 room36)
(free robot3 rgripper3)
(free robot3 lgripper3)
(at ball1 room3)
(at ball2 room16)
(at ball3 room3)
(at ball4 room3)
(at ball5 room5)
(at ball6 room6)
(at ball7 room6)
(at ball8 room34)
(at ball9 room34)
(at ball10 room36)
(at ball11 room14)
(at ball12 room10)
(at ball13 room8)
(at ball14 room23)
(at ball15 room37)
(at ball16 room21)
(at ball17 room18)
(at ball18 room31)
(at ball19 room26)
(at ball20 room18)
(at ball21 room17)
(at ball22 room34)
(at ball23 room16)
(at ball24 room3)
(at ball25 room30)
(at ball26 room25)
(at ball27 room15)
(at ball28 room19)
(at ball29 room29)
(at ball30 room16)
(at ball31 room18)
(at ball32 room32)
(at ball33 room32)
(at ball34 room20)
(at ball35 room35)
)
(:goal
(and
(at ball1 room36)
(at ball2 room25)
(at ball3 room3)
(at ball4 room32)
(at ball5 room22)
(at ball6 room2)
(at ball7 room9)
(at ball8 room31)
(at ball9 room9)
(at ball10 room31)
(at ball11 room30)
(at ball12 room29)
(at ball13 room11)
(at ball14 room24)
(at ball15 room17)
(at ball16 room29)
(at ball17 room3)
(at ball18 room14)
(at ball19 room8)
(at ball20 room6)
(at ball21 room6)
(at ball22 room32)
(at ball23 room20)
(at ball24 room25)
(at ball25 room24)
(at ball26 room36)
(at ball27 room6)
(at ball28 room18)
(at ball29 room30)
(at ball30 room25)
(at ball31 room16)
(at ball32 room29)
(at ball33 room13)
(at ball34 room18)
(at ball35 room23)
)
)
)

; plan
1. (pick robot3 ball10 room36 lgripper3)
   deleted: (at ball10 room36) (free robot3 lgripper3)
   added: (carry robot3 ball10 lgripper3)
   goals met: 1 of 35
2. (pick robot1 ball5 room5 lgripper1)
   deleted: (at ball5 room5) (free robot1 lgripper1)
   added: (carry robot1 ball5 lgripper1)
   goals met: 1 of 35
3. (move robot2 room2 room9)
   deleted: (at-robby robot2 room2)
   added: (at-robby robot2 room9)
   goals met: 1 of 35
4. (move robot1 room5 room9)
   deleted: (at-robby robot1 room5)
   added: (at-robby robot1 room9)
   goals met: 1 of 35
5. (move robot3 room36 room8)
   deleted: (at-robby robot3 room36)
   added: (at-robby robot3 room8)
   goals met: 1 of 35
6. (move robot2 room9 room6)
   deleted: (at-robby robot2 room9)
   added: (at-robby robot2 room6)
   goals met: 1 of 35
7. (move robot1 room9 room22)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room22)
   goals met: 1 of 35
8. (pick robot3 ball13 room8 rgripper3)
   deleted: (at ball13 room8) (free robot3 rgripper3)
   added: (carry robot3 ball13 rgripper3)
   goals met: 1 of 35
9. (pick robot2 ball7 room6 lgripper2)
   deleted: (at ball7 room6) (free robot2 lgripper2)
   added: (carry robot2 ball7 lgripper2)
   goals met: 1 of 35
10. (drop robot1 ball5 room22 lgripper1)
   deleted: (carry robot1 ball5 lgripper1)
   added: (at ball5 room22) (free robot1 lgripper1)
   goals met: 2 of 35
11. (move robot3 room8 room31)
   deleted: (at-robby robot3 room8)
   added: (at-robby robot3 room31)
   goals met: 2 of 35
12. (move robot2 room6 room9)
   deleted: (at-robby robot2 room6)
   added: (at-robby robot2 room9)
   goals met: 2 of 35
13. (drop robot3 ball10 room31 lgripper3)
   deleted: (carry robot3 ball10 lgripper3)
   added: (at ball10 room31) (free robot3 lgripper3)
   goals met: 3 of 35
14. (move robot1 room22 room26)
   deleted: (at-robby robot1 room22)
   added: (at-robby robot1 room26)
   goals met: 3 of 35
15. (drop robot2 ball7 room9 lgripper2)
   deleted: (carry robot2 ball7 lgripper2)
   added: (at ball7 room9) (free robot2 lgripper2)
   goals met: 4 of 35
16. (move robot3 room31 room11)
   deleted: (at-robby robot3 room31)
   added: (at-robby robot3 room11)
   goals met: 4 of 35
17. (pick robot1 ball19 room26 lgripper1)
   deleted: (at ball19 room26) (free robot1 lgripper1)
   added: (carry robot1 ball19 lgripper1)
   goals met: 4 of 35
18. (move robot2 room9 room10)
   deleted: (at-robby robot2 room9)
   added: (at-robby robot2 room10)
   goals met: 4 of 35
19. (drop robot3 ball13 room11 rgripper3)
   deleted: (carry robot3 ball13 rgripper3)
   added: (at ball13 room11) (free robot3 rgripper3)
   goals met: 5 of 35
20. (move robot1 room26 room8)
   deleted: (at-robby robot1 room26)
   added: (at-robby robot1 room8)
   goals met: 5 of 35
21. (pick robot2 ball12 room10 lgripper2)
   deleted: (at ball12 room10) (free robot2 lgripper2)
   added: (carry robot2 ball12 lgripper2)
   goals met: 5 of 35
22. (drop robot1 ball19 room8 lgripper1)
   deleted: (carry robot1 ball19 lgripper1)
   added: (at ball19 room8) (free robot1 lgripper1)
   goals met: 6 of 35
23. (move robot2 room10 room29)
   deleted: (at-robby robot2 room10)
   added: (at-robby robot2 room29)
   goals met: 6 of 35
24. (move robot3 room11 room9)
   deleted: (at-robby robot3 room11)
   added: (at-robby robot3 room9)
   goals met: 6 of 35
25. (drop robot2 ball12 room29 lgripper2)
   deleted: (carry robot2 ball12 lgripper2)
   added: (at ball12 room29) (free robot2 lgripper2)
   goals met: 7 of 35
26. (move robot1 room8 room9)
   deleted: (at-robby robot1 room8)
   added: (at-robby robot1 room9)
   goals met: 7 of 35
27. (pick robot2 ball29 room29 rgripper2)
   deleted: (at ball29 room29) (free robot2 rgripper2)
   added: (carry robot2 ball29 rgripper2)
   goals met: 7 of 35
28. (move robot3 room9 room30)
   deleted: (at-robby robot3 room9)
   added: (at-robby robot3 room30)
   goals met: 7 of 35
29. (move robot2 room29 room30)
   deleted: (at-robby robot2 room29)
   added: (at-robby robot2 room30)
   goals met: 7 of 35
30. (pick robot3 ball25 room30 lgripper3)
   deleted: (at ball25 room30) (free robot3 lgripper3)
   added: (carry robot3 ball25 lgripper3)
   goals met: 7 of 35
31. (move robot1 room9 room6)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room6)
   goals met: 7 of 35
32. (drop robot2 ball29 room30 rgripper2)
   deleted: (carry robot2 ball29 rgripper2)
   added: (at ball29 room30) (free robot2 rgripper2)
   goals met: 8 of 35
33. (move robot3 room30 room24)
   deleted: (at-robby robot3 room30)
   added: (at-robby robot3 room24)
   goals met: 8 of 35
34. (pick robot1 ball6 room6 lgripper1)
   deleted: (at ball6 room6) (free robot1 lgripper1)
   added: (carry robot1 ball6 lgripper1)
   goals met: 8 of 35
35. (drop robot3 ball25 room24 lgripper3)
   deleted: (carry robot3 ball25 lgripper3)
   added: (at ball25 room24) (free robot3 lgripper3)
   goals met: 9 of 35
36. (move robot1 room6 room2)
   deleted: (at-robby robot1 room6)
   added: (at-robby robot1 room2)
   goals met: 9 of 35
37. (move robot2 room30 room37)
   deleted: (at-robby robot2 room30)
   added: (at-robby robot2 room37)
   goals met: 9 of 35
38. (drop robot1 ball6 room2 lgripper1)
   deleted: (carry robot1 ball6 lgripper1)
   added: (at ball6 room2) (free robot1 lgripper1)
   goals met: 10 of 35
39. (pick robot2 ball15 room37 lgripper2)
   deleted: (at ball15 room37) (free robot2 lgripper2)
   added: (carry robot2 ball15 lgripper2)
   goals met: 10 of 35
40. (move robot3 room24 room9)
   deleted: (at-robby robot3 room24)
   added: (at-robby robot3 room9)
   goals met: 10 of 35
41. (move robot2 room37 room17)
   deleted: (at-robby robot2 room37)
   added: (at-robby robot2 room17)
   goals met: 10 of 35
42. (move robot1 room2 room9)
   deleted: (at-robby robot1 room2)
   added: (at-robby robot1 room9)
   goals met: 10 of 35
43. (move robot3 room9 room35)
   deleted: (at-robby robot3 room9)
   added: (at-robby robot3 room35)
   goals met: 10 of 35
44. (move robot1 room9 room6)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room6)
   goals met: 10 of 35
45. (drop robot2 ball15 room17 lgripper2)
   deleted: (carry robot2 ball15 lgripper2)
   added: (at ball15 room17) (free robot2 lgripper2)
   goals met: 11 of 35
46. (pick robot2 ball21 room17 rgripper2)
   deleted: (at ball21 room17) (free robot2 rgripper2)
   added: (carry robot2 ball21 rgripper2)
   goals met: 11 of 35
47. (pick robot3 ball35 room35 lgripper3)
   deleted: (at ball35 room35) (free robot3 lgripper3)
   added: (carry robot3 ball35 lgripper3)
   goals met: 11 of 35
48. (move robot2 room17 room6)
   deleted: (at-robby robot2 room17)
   added: (at-robby robot2 room6)
   goals met: 11 of 35
49. (move robot3 room35 room23)
   deleted: (at-robby robot3 room35)
   added: (at-robby robot3 room23)
   goals met: 11 of 35
50. (move robot1 room6 room34)
   deleted: (at-robby robot1 room6)
   added: (at-robby robot1 room34)
   goals met: 11 of 35
51. (drop robot2 ball21 room6 rgripper2)
   deleted: (carry robot2 ball21 rgripper2)
   added: (at ball21 room6) (free robot2 rgripper2)
   goals met: 12 of 35
52. (drop robot3 ball35 room23 lgripper3)
   deleted: (carry robot3 ball35 lgripper3)
   added: (at ball35 room23) (free robot3 lgripper3)
   goals met: 13 of 35
53. (pick robot3 ball14 room23 rgripper3)
   deleted: (at ball14 room23) (free robot3 rgripper3)
   added: (carry robot3 ball14 rgripper3)
   goals met: 13 of 35
54. (pick robot1 ball9 room34 lgripper1)
   deleted: (at ball9 room34) (free robot1 lgripper1)
   added: (carry robot1 ball9 lgripper1)
   goals met: 13 of 35
55. (move robot3 room23 room24)
   deleted: (at-robby robot3 room23)
   added: (at-robby robot3 room24)
   goals met: 13 of 35
56. (move robot1 room34 room9)
   deleted: (at-robby robot1 room34)
   added: (at-robby robot1 room9)
   goals met: 13 of 35
57. (move robot2 room6 room21)
   deleted: (at-robby robot2 room6)
   added: (at-robby robot2 room21)
   goals met: 13 of 35
58. (drop robot3 ball14 room24 rgripper3)
   deleted: (carry robot3 ball14 rgripper3)
   added: (at ball14 room24) (free robot3 rgripper3)
   goals met: 14 of 35
59. (drop robot1 ball9 room9 lgripper1)
   deleted: (carry robot1 ball9 lgripper1)
   added: (at ball9 room9) (free robot1 lgripper1)
   goals met: 15 of 35
60. (pick robot2 ball16 room21 lgripper2)
   deleted: (at ball16 room21) (free robot2 lgripper2)
   added: (carry robot2 ball16 lgripper2)
   goals met: 15 of 35
61. (move robot2 room21 room29)
   deleted: (at-robby robot2 room21)
   added: (at-robby robot2 room29)
   goals met: 15 of 35
62. (move robot3 room24 room6)
   deleted: (at-robby robot3 room24)
   added: (at-robby robot3 room6)
   goals met: 15 of 35
63. (move robot1 room9 room6)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room6)
   goals met: 15 of 35
64. (drop robot2 ball16 room29 lgripper2)
   deleted: (carry robot2 ball16 lgripper2)
   added: (at ball16 room29) (free robot2 lgripper2)
   goals met: 16 of 35
65. (move robot1 room6 room32)
   deleted: (at-robby robot1 room6)
   added: (at-robby robot1 room32)
   goals met: 16 of 35
66. (move robot3 room6 room34)
   deleted: (at-robby robot3 room6)
   added: (at-robby robot3 room34)
   goals met: 16 of 35
67. (move robot2 room29 room6)
   deleted: (at-robby robot2 room29)
   added: (at-robby robot2 room6)
   goals met: 16 of 35
68. (pick robot1 ball33 room32 lgripper1)
   deleted: (at ball33 room32) (free robot1 lgripper1)
   added: (carry robot1 ball33 lgripper1)
   goals met: 16 of 35
69. (pick robot1 ball32 room32 rgripper1)
   deleted: (at ball32 room32) (free robot1 rgripper1)
   added: (carry robot1 ball32 rgripper1)
   goals met: 16 of 35
70. (pick robot3 ball8 room34 lgripper3)
   deleted: (at ball8 room34) (free robot3 lgripper3)
   added: (carry robot3 ball8 lgripper3)
   goals met: 16 of 35
71. (pick robot3 ball22 room34 rgripper3)
   deleted: (at ball22 room34) (free robot3 rgripper3)
   added: (carry robot3 ball22 rgripper3)
   goals met: 16 of 35
72. (move robot1 room32 room29)
   deleted: (at-robby robot1 room32)
   added: (at-robby robot1 room29)
   goals met: 16 of 35
73. (move robot3 room34 room32)
   deleted: (at-robby robot3 room34)
   added: (at-robby robot3 room32)
   goals met: 16 of 35
74. (move robot2 room6 room36)
   deleted: (at-robby robot2 room6)
   added: (at-robby robot2 room36)
   goals met: 16 of 35
75. (drop robot1 ball32 room29 rgripper1)
   deleted: (carry robot1 ball32 rgripper1)
   added: (at ball32 room29) (free robot1 rgripper1)
   goals met: 17 of 35
76. (drop robot3 ball22 room32 rgripper3)
   deleted: (carry robot3 ball22 rgripper3)
   added: (at ball22 room32) (free robot3 rgripper3)
   goals met: 18 of 35
77. (move robot2 room36 room6)
   deleted: (at-robby robot2 room36)
   added: (at-robby robot2 room6)
   goals met: 18 of 35
78. (move robot1 room29 room13)
   deleted: (at-robby robot1 room29)
   added: (at-robby robot1 room13)
   goals met: 18 of 35
79. (move robot3 room32 room31)
   deleted: (at-robby robot3 room32)
   added: (at-robby robot3 room31)
   goals met: 18 of 35
80. (move robot2 room6 room14)
   deleted: (at-robby robot2 room6)
   added: (at-robby robot2 room14)
   goals met: 18 of 35
81. (drop robot1 ball33 room13 lgripper1)
   deleted: (carry robot1 ball33 lgripper1)
   added: (at ball33 room13) (free robot1 lgripper1)
   goals met: 19 of 35
82. (drop robot3 ball8 room31 lgripper3)
   deleted: (carry robot3 ball8 lgripper3)
   added: (at ball8 room31) (free robot3 lgripper3)
   goals met: 20 of 35
83. (pick robot3 ball18 room31 rgripper3)
   deleted: (at ball18 room31) (free robot3 rgripper3)
   added: (carry robot3 ball18 rgripper3)
   goals met: 20 of 35
84. (pick robot2 ball11 room14 lgripper2)
   deleted: (at ball11 room14) (free robot2 lgripper2)
   added: (carry robot2 ball11 lgripper2)
   goals met: 20 of 35
85. (move robot3 room31 room14)
   deleted: (at-robby robot3 room31)
   added: (at-robby robot3 room14)
   goals met: 20 of 35
86. (move robot2 room14 room30)
   deleted: (at-robby robot2 room14)
   added: (at-robby robot2 room30)
   goals met: 20 of 35
87. (move robot1 room13 room3)
   deleted: (at-robby robot1 room13)
   added: (at-robby robot1 room3)
   goals met: 20 of 35
88. (drop robot3 ball18 room14 rgripper3)
   deleted: (carry robot3 ball18 rgripper3)
   added: (at ball18 room14) (free robot3 rgripper3)
   goals met: 21 of 35
89. (drop robot2 ball11 room30 lgripper2)
   deleted: (carry robot2 ball11 lgripper2)
   added: (at ball11 room30) (free robot2 lgripper2)
   goals met: 22 of 35
90. (pick robot1 ball4 room3 lgripper1)
   deleted: (at ball4 room3) (free robot1 lgripper1)
   added: (carry robot1 ball4 lgripper1)
   goals met: 22 of 35
91. (move robot3 room14 room6)
   deleted: (at-robby robot3 room14)
   added: (at-robby robot3 room6)
   goals met: 22 of 35
92. (move robot1 room3 room32)
   deleted: (at-robby robot1 room3)
   added: (at-robby robot1 room32)
   goals met: 22 of 35
93. (move robot2 room30 room3)
   deleted: (at-robby robot2 room30)
   added: (at-robby robot2 room3)
   goals met: 22 of 35
94. (drop robot1 ball4 room32 lgripper1)
   deleted: (carry robot1 ball4 lgripper1)
   added: (at ball4 room32) (free robot1 lgripper1)
   goals met: 23 of 35
95. (pick robot2 ball24 room3 lgripper2)
   deleted: (at ball24 room3) (free robot2 lgripper2)
   added: (carry robot2 ball24 lgripper2)
   goals met: 23 of 35
96. (move robot3 room6 room25)
   deleted: (at-robby robot3 room6)
   added: (at-robby robot3 room25)
   goals met: 23 of 35
97. (move robot2 room3 room25)
   deleted: (at-robby robot2 room3)
   added: (at-robby robot2 room25)
   goals met: 23 of 35
98. (move robot1 room32 room6)
   deleted: (at-robby robot1 room32)
   added: (at-robby robot1 room6)
   goals met: 23 of 35
99. (pick robot3 ball26 room25 lgripper3)
   deleted: (at ball26 room25) (free robot3 lgripper3)
   added: (carry robot3 ball26 lgripper3)
   goals met: 23 of 35
100. (drop robot2 ball24 room25 lgripper2)
   deleted: (carry robot2 ball24 lgripper2)
   added: (at ball24 room25) (free robot2 lgripper2)
   goals met: 24 of 35
101. (move robot3 room25 room3)
   deleted: (at-robby robot3 room25)
   added: (at-robby robot3 room3)
   goals met: 24 of 35
102. (move robot1 room6 room20)
   deleted: (at-robby robot1 room6)
   added: (at-robby robot1 room20)
   goals met: 24 of 35
103. (pick robot3 ball1 room3 rgripper3)
   deleted: (at ball1 room3) (free robot3 rgripper3)
   added: (carry robot3 ball1 rgripper3)
   goals met: 24 of 35
104. (move robot2 room25 room6)
   deleted: (at-robby robot2 room25)
   added: (at-robby robot2 room6)
   goals met: 24 of 35
105. (pick robot1 ball34 room20 lgripper1)
   deleted: (at ball34 room20) (free robot1 lgripper1)
   added: (carry robot1 ball34 lgripper1)
   goals met: 24 of 35
106. (move robot3 room3 room36)
   deleted: (at-robby robot3 room3)
   added: (at-robby robot3 room36)
   goals met: 24 of 35
107. (move robot1 room20 room19)
   deleted: (at-robby robot1 room20)
   added: (at-robby robot1 room19)
   goals met: 24 of 35
108. (move robot2 room6 room18)
   deleted: (at-robby robot2 room6)
   added: (at-robby robot2 room18)
   goals met: 24 of 35
109. (drop robot3 ball26 room36 lgripper3)
   deleted: (carry robot3 ball26 lgripper3)
   added: (at ball26 room36) (free robot3 lgripper3)
   goals met: 25 of 35
110. (drop robot3 ball1 room36 rgripper3)
   deleted: (carry robot3 ball1 rgripper3)
   added: (at ball1 room36) (free robot3 rgripper3)
   goals met: 26 of 35
111. (pick robot1 ball28 room19 rgripper1)
   deleted: (at ball28 room19) (free robot1 rgripper1)
   added: (carry robot1 ball28 rgripper1)
   goals met: 26 of 35
112. (pick robot2 ball31 room18 lgripper2)
   deleted: (at ball31 room18) (free robot2 lgripper2)
   added: (carry robot2 ball31 lgripper2)
   goals met: 26 of 35
113. (pick robot2 ball20 room18 rgripper2)
   deleted: (at ball20 room18) (free robot2 rgripper2)
   added: (carry robot2 ball20 rgripper2)
   goals met: 26 of 35
114. (move robot1 room19 room18)
   deleted: (at-robby robot1 room19)
   added: (at-robby robot1 room18)
   goals met: 26 of 35
115. (move robot3 room36 room6)
   deleted: (at-robby robot3 room36)
   added: (at-robby robot3 room6)
   goals met: 26 of 35
116. (move robot2 room18 room16)
   deleted: (at-robby robot2 room18)
   added: (at-robby robot2 room16)
   goals met: 26 of 35
117. (drop robot1 ball34 room18 lgripper1)
   deleted: (carry robot1 ball34 lgripper1)
   added: (at ball34 room18) (free robot1 lgripper1)
   goals met: 27 of 35
118. (drop robot1 ball28 room18 rgripper1)
   deleted: (carry robot1 ball28 rgripper1)
   added: (at ball28 room18) (free robot1 rgripper1)
   goals met: 28 of 35
119. (drop robot2 ball31 room16 lgripper2)
   deleted: (carry robot2 ball31 lgripper2)
   added: (at ball31 room16) (free robot2 lgripper2)
   goals met: 29 of 35
120. (move robot3 room6 room16)
   deleted: (at-robby robot3 room6)
   added: (at-robby robot3 room16)
   goals met: 29 of 35
121. (pick robot1 ball17 room18 rgripper1)
   deleted: (at ball17 room18) (free robot1 rgripper1)
   added: (carry robot1 ball17 rgripper1)
   goals met: 29 of 35
122. (move robot2 room16 room6)
   deleted: (at-robby robot2 room16)
   added: (at-robby robot2 room6)
   goals met: 29 of 35
123. (pick robot3 ball30 room16 lgripper3)
   deleted: (at ball30 room16) (free robot3 lgripper3)
   added: (carry robot3 ball30 lgripper3)
   goals met: 29 of 35
124. (pick robot3 ball2 room16 rgripper3)
   deleted: (at ball2 room16) (free robot3 rgripper3)
   added: (carry robot3 ball2 rgripper3)
   goals met: 29 of 35
125. (move robot1 room18 room3)
   deleted: (at-robby robot1 room18)
   added: (at-robby robot1 room3)
   goals met: 29 of 35
126. (drop robot2 ball20 room6 rgripper2)
   deleted: (carry robot2 ball20 rgripper2)
   added: (at ball20 room6) (free robot2 rgripper2)
   goals met: 30 of 35
127. (move robot3 room16 room25)
   deleted: (at-robby robot3 room16)
   added: (at-robby robot3 room25)
   goals met: 30 of 35
128. (drop robot1 ball17 room3 rgripper1)
   deleted: (carry robot1 ball17 rgripper1)
   added: (at ball17 room3) (free robot1 rgripper1)
   goals met: 31 of 35
129. (drop robot3 ball30 room25 lgripper3)
   deleted: (carry robot3 ball30 lgripper3)
   added: (at ball30 room25) (free robot3 lgripper3)
   goals met: 32 of 35
130. (drop robot3 ball2 room25 rgripper3)
   deleted: (carry robot3 ball2 rgripper3)
   added: (at ball2 room25) (free robot3 rgripper3)
   goals met: 33 of 35
131. (move robot2 room6 room16)
   deleted: (at-robby robot2 room6)
   added: (at-robby robot2 room16)
   goals met: 33 of 35
132. (pick robot2 ball23 room16 lgripper2)
   deleted: (at ball23 room16) (free robot2 lgripper2)
   added: (carry robot2 ball23 lgripper2)
   goals met: 33 of 35
133. (move robot3 room25 room6)
   deleted: (at-robby robot3 room25)
   added: (at-robby robot3 room6)
   goals met: 33 of 35
134. (move robot1 room3 room6)
   deleted: (at-robby robot1 room3)
   added: (at-robby robot1 room6)
   goals met: 33 of 35
135. (move robot2 room16 room20)
   deleted: (at-robby robot2 room16)
   added: (at-robby robot2 room20)
   goals met: 33 of 35
136. (move robot1 room6 room15)
   deleted: (at-robby robot1 room6)
   added: (at-robby robot1 room15)
   goals met: 33 of 35
137. (drop robot2 ball23 room20 lgripper2)
   deleted: (carry robot2 ball23 lgripper2)
   added: (at ball23 room20) (free robot2 lgripper2)
   goals met: 34 of 35
138. (pick robot1 ball27 room15 lgripper1)
   deleted: (at ball27 room15) (free robot1 lgripper1)
   added: (carry robot1 ball27 lgripper1)
   goals met: 34 of 35
139. (move robot1 room15 room6)
   deleted: (at-robby robot1 room15)
   added: (at-robby robot1 room6)
   goals met: 34 of 35
140. (drop robot1 ball27 room6 lgripper1)
   deleted: (carry robot1 ball27 lgripper1)
   added: (at ball27 room6) (free robot1 lgripper1)
   goals met: 35 of 35
